ServiceInvoke/SOAPRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.cdyne.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:ResolveIP>
         <ws:ipAddress>193.81.58.53</ws:ipAddress>
         <ws:licenseKey>?</ws:licenseKey>
      </ws:ResolveIP>
   </soapenv:Body>
</soapenv:Envelope>