APIAutomation/SOAP_TEST/ipRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.cdyne.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:ResolveIP>
         <!--Optional:-->
         <ws:ipAddress>209.206.5.5</ws:ipAddress>
         <!--Optional:-->
         <ws:licenseKey>null</ws:licenseKey>
      </ws:ResolveIP>
   </soapenv:Body>
</soapenv:Envelope>